{"TF_Idf_score":10.5184540149,"bm25":1.5876147942,"deduplication":["No Duplicates"],"deduplications":"No Duplicates","description":"Oct 21, 2021 — Mihoko Matsubara is Chief Cybersecurity Strategist, NTT Corporation, Tokyo, being responsible for cybersecurity thought leadership.","duplicate_content":0.0,"duplicates":[0],"duplicates_message":"No similar records ","excluded":0,"excluded_keyword_content":null,"flag_original_record":1.0,"full_name_match":0.0,"full_text":"A Singapore Government Agency Website Show menu Advisory Panels and Committees Cyber Security Advisory Panel Decrease font size Increase font size Print this page The MAS Cyber Security Advisory Panel (CSAP) comprises leading cyber security experts and thought leaders. The panel advises on strategies for MAS and financial institutions in Singapore to sustain cyber resilience and trust in our financial system. About the Panel MAS Cyber Security Advisory Panel (CSAP) was formed in 2017. It was established  To provide MAS with a global perspective on the evolving technology and cyber threat landscape, and its implications for financial services. As a platform to share best practices on cyber security strategies and approaches. To recommend measures to enhance the cyber resilience of Singapore financial sector. To be the sounding board on cyber initiatives that MAS intends to pursue. Ms. Valerie Abend Managing Director, Global Banking Security Lead, Accenture Valerie Abend has over two decades of experience spearheading financial services sector wide and enterprise wide security and resilience programs. As Accenture leader for the Global Financial Services Security Practice and the South Security Market Practice, Valerie advises C suite executives, board, regulators and policymakers on managing cyber risk and resilience. Previously, Valerie served as the Senior Critical Infrastructure Officer for the U.S. Department of the Treasury Office of the Comptroller of the Currency. In this role, she conceptualized and led the U.S. Federal banking agencies' cybersecurity and resilience strategy. She was a Managing Director at Bank of New York Mellon and has held positions with the Federal Reserve Board and as Deputy Assistant Secretary for Critical Infrastructure Protection at the Treasury Department. Valerie has testified several times in front of Congress and is frequently quoted in media on cybersecurity issues. She spearheaded the formation and serves as the Chair of the Accenture Cybersecurity Forum Women Council and as a member of the Monetary Authority of Singapore Cyber Security Advisory Panel, Cloud Security Alliance Board, the Sector Board Advisors for the Financial Services Information Sharing and Analysis Center (FS ISAC), and the Advisory Group of the Carnegie Endowment for International Peace FinCyber Project. Mr. Keith Alexander Founder and CEO, IronNet Cybersecurity Inc GEN Keith Alexander (Ret.), Founder, Chairman & Co CEO of IronNet Cybersecurity, is one of the foremost authorities on cybersecurity in the world. A four star Army general, GEN Alexander was previously the highest ranked military official of USCYBERCOM, NSA CSS, where he led these DoD agencies during the conflicts in Afghanistan and Iraq when attempted cyber attacks against the U.S. were on the rise. In recognition of cyber increasing importance, President Barack Obama and Defense Secretary Robert Gates appointed GEN Alexander as the first commander of USCYBERCOM, a newly created military institution charged with defending the nation security in cyberspace against sophisticated cyber threats to businesses and government operations in an increasingly interconnected world. A leader with vision and a pragmatic approach to tackling the ever changing cyber threat landscape, GEN Alexander built IronNet to bring this knowledge and experience to the private sector and fill in a critical gap between cyber threats and available security technology. IronNet provides best in class cyber defense based on complex behavioral modeling, big data analytics and advanced computing capability. GEN Alexander holds a B.S. from the U.S. Military Academy, an M.S. in Business Administration from Boston University and M.S. degrees in Systems Technology, Physics and National Security Strategy. Mr. Scott Charney Corporate Vice President, Security Policy, Microsoft Corporation Mr. Scott Charney is Vice President for Security Policy at Microsoft, working with public and private sector organizations to develop and implement strategies to help secure the IT ecosystem. He currently serves as Vice Chair of the National Security Telecommunications Advisory Committee, as a Commissioner on the Global Commission for the Stability of Cyberspace, and as Chair of the Board of the Global Cyber Alliance. Prior to his current position, Mr. Charney led Microsoft Trustworthy Computing Group where he was responsible for enforcing Microsoft mandatory security engineering policies and implementing Microsoft security strategy. Before that, Mr. Charney served as chief of the Computer Crime and Intellectual Property Section (CCIPS) at the U.S. Department of Justice (DOJ) where he was responsible for implementing DOJ computer crime and intellectual property initiatives. Under his direction, CCIPS investigated and prosecuted national and international hacker cases, economic espionage cases, and violations of the federal criminal copyright and trademark laws. He served three years as chair of the G8 Subgroup on High Tech Crime, was vice chair of the Organization of Economic Cooperation and Development (OECD) Group of Experts on Security and Privacy, led the U.S. Delegation to the OECD on Cryptography Policy, and was co chair of the Center for Strategic and International Studies Commission on Cybersecurity for the 44th Presidency. Mr. Charney graduated from the Syracuse University College of Law with honors and received his undergraduate degree from the State University of New York at Binghamton. Mr. Kang Meng Chow Principal, Security Assurance, Amazon Web Services Meng Chow has been a practicing information security professional for more than 30 years with field experience spanning from technical to management in the various information security and risk management roles, including the Singapore government, major multi national financial institutions, and global security and technology providers. Meng Chow research and part of his experience in the field have been published in his book, \"Responsive Security   Be ready to be secure\", by CRC Press in Oct 2013. His contributions to the information security industry and community have also been marked by numerous industry awards As leader of the security assurance team in AWS Asia Pacific, Japan, and China region, Meng Chow and his team work with customers to identify and address related concerns and needs in cloud computing security. Meng Chow has been active in the information security community, and was a Director of the (ISC)2 Board from Jan 2015 to Dec 2017. He was also recipient of the (ISC)2 James Wade Service Award in 2014. Meng Chow has also been contributing to both local and international security standardization efforts since 1998, in which he has held several committee and working group chair and editorial positions in the Singapore national standards body, ITU T SG17, and ISO IEC JTC 1 SC 27. Meng Chow is also co Chair of the Asia Regional Information Security Exchange (RAISE) Forum, which he co founded with a group of security experts in 2004. Besides contributing to the industry and community, Meng Chow continues to conduct research and teach information security as an Associate Professor (Adjunct) with the School of Computer Science & Engineering at Nanyang Technology University, Singapore. Meng Chow received his MSc degree in Information Security from the Royal Holloway and Bedford New College, University of London, and completed his PhD in Information Security Risk Management at the Southern Cross University, Australia. He has also been a Certified Information Systems Security Professional (CISSP) since 1998 Mr. David Koh Commissioner of Cybersecurity and Chief Executive, Cyber Security Agency of Singapore Mr David Koh is the Commissioner of Cybersecurity and Chief Executive of the Cyber Security Agency (CSA) of Singapore. As a Commissioner, he has the legal authority to investigate cyber threats and incidents to ensure that essential services are not disrupted in the event of a cyber attack. Concurrently, as Chief Executive of CSA, he leads Singapore efforts to provide dedicated and centralised oversight of national cyber security functions. These include enforcing the cybersecurity legislation, strategy and policy development, cyber security operations, ecosystem development, public outreach and international engagement. Mr Koh also sits on the Boards of the Government Technology Agency (GovTech), DSO National Laboratories (DSO), the Monetary Authority of Singapore (MAS) Cyber Security Advisory Panel and the Healthcare Cybersecurity Advisory Panel (HCAP). Prior to his current appointments, Mr Koh served in the SAF and held various command and staff appointments in MINDEF and the SAF. He previously held the positions of Deputy Secretary (Special Projects) and Defence Cyber Chief of MINDEF, where he was responsible for leading and coordinating cyber defence policy, capability development, and operations for Singapore defence cluster. Mr Koh is the recipient of the first Billington CyberSecurity International Leadership Award. He has also been awarded the Public Administration Medal   Gold, the Public Administration Medal   Silver (Military), the Public Administration Medal   Bronze (Military), and the Commendation Medal (Military). Mr Koh has a Master degree in Public Administration from Harvard University, USA  and a Bachelor degree in Electrical and Electronics Engineering from King College, London, UK. He and his wife, Marlene, have three children, Daniel, Rachel and Michael. Ms. Cheri McGuire Chief Technology Officer, SWIFT Ms. McGuire is a technology and cyber security risk and advisory leader with more than 30 years in strategy, policy, and operations, and spanning the financial, technology, consulting and government sectors. She currently serves as the Chief Technology Officer for SWIFT, a global member owned cooperative providing secure financial messaging services and products that connect more than 11,000 financial organizations in more than 200 countries and territories. As CTO, she oversees all aspects of the SWIFT technology platform, network, cloud capabilities and security, with a focus on resilience, trust and innovation. In addition, she is a non resident scholar for the Cyber Policy Initiative and member of the FinCyber Advisory Group at the Carnegie Endowment for International Peace, a leading global think tank. She also sits on the Board of Directors for the Cybercrime Support Network, a non profit partnering with federal, state and local organizations to help individuals and small businesses respond to and recover from the impacts of cybercrime. Prior to her role at SWIFT, she served on the board of directors for Entrust Corporation, and on the advisory boards for Tenable, Garrison, Security Scorecard, and X Analytics corporations. From 2016 to 2019, she served as managing director and Group Chief Information Security Officer for Standard Chartered PLC in London. She was responsible for the bank global information and cyber risk management strategy, governance, policy, training awareness, third party security risk, control assurance testing, regulatory engagement, and industry partnerships. Prior to Standard Chartered, she served as vice president of global government affairs and cybersecurity policy at Symantec, director for critical infrastructure and cybersecurity in Microsoft Trustworthy Computing Group, director of the DHS National Cyber Security Division US CERT, program manager at Booz Allen Hamilton, and as a congressional staffer. In addition, she previously served on the World Economic Forum Global Future Council on Cybersecurity, the Europol Advisory Group on Financial Services, the UK Cyber Defence Alliance Board, and the Industry Executive Subcommittee of the President National Security Telecommunications Advisory Committee. She has testified numerous times as an invited expert before the US Congress. Mr. Udi Mokady Chairman and Chief Executive Officer, CyberArk Udi Mokady is the Chairman and CEO of CyberArk, and a pioneer in establishing the Privileged Account Security software market. Since co founding the company in 1999, Mokady has entrenched CyberArk as the market leader. During his tenure at CyberArk, Mokady has also served as CyberArk chief strategist and visionary, overseeing global expansion, management, execution and corporate development. Since assuming the position of CEO in 2005, Mokady leadership and direction has been instrumental in guiding CyberArk to achieve record growth, while accelerating overall market adoption for privileged access security solutions to protect against an evolving advanced threat landscape. Mokady was elected Chairman of the Board in 2016. Prior to his role as CEO, Mokady served as CyberArk COO between 1999 and 2005. During this time, Mokady established CyberArk US headquarters in Newton, Massachusetts and successfully transitioned the company to a market leadership position in Privileged Access Security by helping organizations to recognize the connection between privileged access and advanced internal and external security threats. Mokady also orchestrated the company market expansion in the US, Europe, and Asia by elevating awareness of privilege related security and compliance risks while successfully implementing and managing channel development, international sales operations and marketing for CyberArk award winning information security products. Prior to CyberArk, Mokady specialized in legal management and business development for international high tech companies. He previously served as the general counsel at Tadiran Spectralink, a highly specialized producer of secure wireless communications systems. Mokady received the 2018 Asper Award for Global Entrepreneurship from Brandeis University and a 2017 SC Media Reboot Award as a cyber security influencer. He was named the 2014 Ernst & Young Entrepreneur of the Year for the Technology Security category in New England. Mokady is a member of the Monetary Authority of Singapore (MAS) Cyber Security Advisory Panel and was a member of the Demisto Board of Directors prior to its acquisition by Palo Alto Networks in March 2019. Mr. Jason Witty Chief Security Office, United Services Automobile Association Jason Witty serves as the Chief Security Officer (CSO) at United Services Automobile Association (USAA), accountable for Information Security, Physical Security, Privacy, Operational Resiliency, Crisis Management, Executive Protection and Corporate Investigations across the firm, which provides insurance, investing and banking solutions to members of the U.S. military, veterans who have honorably served, and their families. Jason is an award winning CIO CISO and a certified Information Systems Security Management Professional (ISSMP) with more than 28 years of experience on information risk management. He is a delivery and execution oriented leader with a unique blend of executive leadership, management and technical skills, and extensive background in risk management. He is a strong motivator that uses outstanding empathy, communication and negotiation skills to solve business and IT challenges. Prior to his current role, Jason was the Chief Information Officer (CIO) of Cybersecurity & Technology Controls and Global Chief Information Security Officer (CISO) at J.P.Morgan Chase. There, he had responsibility for the firm cybersecurity, technology controls and technology resiliency programs. He lead a team of approximately 3,300 people operating in 23 countries and nearly 50 cities driving transformative change across the company. Before that, he was the EVP and CISO at U.S. Bancorp, providing singular accountability for all information security controls in the company. He was simultaneously responsible for enterprise wide customer authentication products as well as internet and DDA channel fraud. Earlier in his career, Jason also served as the Senior Vice President and Cyber Threat Prevention Services Executive at Bank of America, where he was responsible for a team of information security professionals spanning eight countries who provided global information security risk prevention and deterrence services. Throughout his career, Jason has also provided extensive industry leadership. He has led multiple classified and unclassified sector wide initiatives to upgrade the security posture for U.S. Critical National Infrastructure, including overseeing creation of industry wide products for destructive malware best practices and utilization of clearances within the financial sector. He currently serves as the Vice Chair of the National Technology Security Coalition (NTSC) and also served as the Chair of the Financial Services and Information Sharing and Analysis Center (FS ISAC) from 2 . He previously served as the Sector Chief for Financial Services in FBI Chicago Infragard program. Jason has a Bachelor degree in Electrical Engineering Technology from Old Dominion University. Mr. Doron Tamir Chairman and Co Founder, Cyber Security Group B. General Doron Tamir (Ret.) is a seasoned security and cyber professional with decades of experience in leading technology oriented organizations in the governmental and private sectors. Since 2015, General Tamir is Chairman of Cyber Security Group (CSG), which he co founded together with M. General Professor Isaac Ben Israel and others. CSG is a leading provider of Cyber solutions, services, and strategic consulting to governments, banks, industrial and other enterprises around the world. CSG also establishes cyber innovation centers and cyber schools around the world. In 2012, prior to CSG, General Tamir was nominated to be the Senior Director of the Security Sector at the Israeli National Cyber Directorate (INCD) in the Israeli Prime Minister Office, as part of its founding team. General Tamir also served as Director of International Cooperation at the INCD, and laid the foundation for cooperation with the US Department of Homeland Security (DHS), as well as with other nations around the world. In 1992, General Tamir was appointed to be the Chief Intelligence Officer in the Israeli military. As the Commander of the Israeli Intelligence Corps, General Tamir commanded numerous military units in all aspects of intelligence, including signal, visual, cyber and technology. Between 1968 and 1992, Gen. Tamir had a long career in the Israeli Intelligence Corps, where he commanded numerous intelligence units, in combat, research and other leadership positions. After he completed his military service, and prior to the service at the INCD, General Tamir was Vice President of Strategic Accounts at Ness Technologies, Founder and Managing Director at Corner Shot, and Strategic Consultant to the Israeli Aerospace Industries. Ms. Mihoko Matsubara Chief Cybersecurity Strategist, NTT Corporation, Tokyo Mihoko Matsubara is Chief Cybersecurity Strategist, NTT Corporation, Tokyo, being responsible for cybersecurity thought leadership. She previously served at the Japanese Ministry of Defense for nine years before her MA at the Johns Hopkins School of Advanced International Studies on Fulbright in Washington DC. Prior to joining NTT, she worked as VP and Public Sector Chief Security Officer for Asia Pacific at Palo Alto Networks. She served on Japanese government cybersecurity R&D policy committee between 2014 and 2018. Mihoko is a prolific writer and has published articles from the Council on Foreign Relations, Lawfare, New America, the RUSI Journal, etc. She published a cybersecurity book from the Shinchosha Publishing Co., Ltd in 2019, which won a JFY 2020 award by the Okawa Foundation for Information and Telecommunications. She has spoken at various engagements internationally such as the NIST Cybersecurity Risk Management Conference 2018 in Baltimore, the RSA Conference 2018 and 2019 in San Francisco, Singapore International Cyber Week 2019, the EU Cyber Forum 2019 in Brussels, and CyCon 2015 and 2019 in Tallinn, Estonia. She is Adjunct Fellow at the Pacific Forum, Honolulu, and Associate Fellow at the Henry Jackson Society, London Mr. Patrick Opet Head of Cybersecurity and Technology Controls and Global Chief Information Security Officer, JPMorgan Chase Patrick Opet works for JPMorgan Chase as Head of Cybersecurity & Technology Controls and the firm Global Chief Information Security Officer. He is currently responsible for the technology strategy, design, development and delivery of the firm defensive systems and technology controls and additionally, serves as a mentor in our Diversity, Equity and Inclusion programs. Pat joined JPMorgan Chase from Lockheed Martin in 2014 as an Executive Director and the Global Head of Cybersecurity Programs, leading the development of JPMorgan Chase cybersecurity technology strategy and the firm first cross LOB cybersecurity investment plan. Since joining, Pat was promoted to Managing Director and became a Distinguished Engineer and a member of the Global Technology Architecture Committee. He has an M.S. from the University of Maryland in Computer Systems Management & Information Assurance and a B.S. from George Washington University in Computer Engineering. Mr. Phil Venables Chief Information Security Officer and Vice President, Google Cloud Phil Venables is the Chief Information Security Officer and Vice President of Google Cloud where he leads the risk, security, compliance, and privacy teams. Additionally, he oversees a team of security industry experts and leaders in the Google Cloud Office of the CISO who partner with customers on their secure digital transformations. Prior to joining Google Cloud, Phil was a Partner at Goldman Sachs where he held multiple roles over a long career, initially as their first Chief Information Security Officer, a role he held for 17 years. In subsequent roles he was Chief Risk Officer for the firm operational risks, an operating partner in their private equity business and a senior advisor to the firm clients and executive leadership on cybersecurity, technology risk, digital business risk, and operational resilience. In addition to this, Phil was a Board Director of Goldman Sachs Bank (USA). Before Goldman Sachs, Phil held multiple Chief Information Security Officer as well as senior engineering roles across a range of finance, energy and technology companies. Outside of Google, Phil serves on the boards of the NYU Tandon School of Engineering and the NYU Stern Business School Volatility and Risk Institute. He also serves on the Information Security and Privacy Advisory Board of NIST and is a member of the Council on Foreign Relations. Phil earned a BSc (Hons) in Computer Science from the University of York and an MSc in Computation and Cryptography from the Queen College at Oxford University. He was awarded the designation of Chartered Engineer in 1995 and Chartered Scientist in 2002 and was elected a Fellow of the British Computer Society in 2005. Mr. Chris Krebs Founding Partner of the Krebs Stamos Group Christopher Krebs is Founding Partner of the Krebs Stamos Group and Chair of the Commission on Information Disorder at the Aspen Institute. He previously served as the first director of the Department of Homeland Security (DHS) Cybersecurity and Infrastructure Security Agency (CISA) where he oversaw the Agency efforts to manage risk to the nation businesses and government agencies, bringing together partners to collectively defend against cyber and physical threats. Before serving as CISA Director, Mr. Krebs was appointed in August 2017 as the Assistant Secretary for Infrastructure Protection. Mr. Krebs joined the DHS in March 2017, first serving as Senior Counsellor to the Secretary. Prior to coming to DHS, he led Microsoft U.S. cybersecurity policy efforts. Mr. Krebs holds a bachelor degree in environmental sciences from the University of Virginia and a J.D. from the Antonin Scalia Law School at George Mason University. Monetary Authority of Singapore Subscribe to Updates Get notified whenever news and updates are posted on this website. © 2022, Government of Singapore.Last updated on 21 Oct 2021 Oct 21, 2021   Mihoko Matsubara is Chief Cybersecurity Strategist, NTT Corporation, Tokyo, being responsible for cybersecurity thought leadership. Cyber Security Advisory Panel   Monetary Authority of Singapore","fuzzy_name_match":100.0,"id":"1d418c48-ef31-4833-9d28-d165eb963c6c","jurisdiction":"Global","language":"en","language_id":"en","model_preds":0.1163750812,"record_number":0.0,"score":5.4941331513,"scores_1":0.0022134821,"source_name":"www.mas.gov.sg","source_type":[],"text":"A Singapore Government Agency Website Show menu Advisory Panels and Committees Cyber Security Advisory Panel Decrease font size Increase font size Print this page The MAS Cyber Security Advisory Panel (CSAP) comprises leading cyber security experts and thought leaders. The panel advises on strategies for MAS and financial institutions in Singapore to sustain cyber resilience and trust in our financial system. About the Panel MAS Cyber Security Advisory Panel (CSAP) was formed in 2017. It was established: To provide MAS with a global perspective on the evolving technology and cyber threat landscape, and its implications for financial services. As a platform to share best practices on cyber security strategies and approaches. To recommend measures to enhance the cyber resilience of Singapore's financial sector. To be the sounding board on cyber initiatives that MAS intends to pursue. Ms. Valerie Abend Managing Director, Global Banking Security Lead, Accenture Valerie Abend has over two decades of experience spearheading financial services sector-wide and enterprise-wide security and resilience programs. As Accenture's leader for the Global Financial Services Security Practice and the South Security Market Practice, Valerie advises C-suite executives, board, regulators and policymakers on managing cyber risk and resilience. Previously, Valerie served as the Senior Critical Infrastructure Officer for the U.S. Department of the Treasury's Office of the Comptroller of the Currency. In this role, she conceptualized and led the U.S. Federal banking agencies' cybersecurity and resilience strategy. She was a Managing Director at Bank of New York Mellon and has held positions with the Federal Reserve Board and as Deputy Assistant Secretary for Critical Infrastructure Protection at the Treasury Department. Valerie has testified several times in front of Congress and is frequently quoted in media on cybersecurity issues. She spearheaded the formation and serves as the Chair of the Accenture Cybersecurity Forum Women's Council and as a member of the Monetary Authority of Singapore Cyber Security Advisory Panel, Cloud Security Alliance Board, the Sector Board Advisors for the Financial Services Information Sharing and Analysis Center (FS-ISAC), and the Advisory Group of the Carnegie Endowment for International Peace FinCyber Project. Mr. Keith Alexander Founder and CEO, IronNet Cybersecurity Inc GEN Keith Alexander (Ret.), Founder, Chairman & Co-CEO of IronNet Cybersecurity, is one of the foremost authorities on cybersecurity in the world. A four-star Army general, GEN Alexander was previously the highest-ranked military official of USCYBERCOM, NSA\/CSS, where he led these DoD agencies during the conflicts in Afghanistan and Iraq when attempted cyber attacks against the U.S. were on the rise. In recognition of cyber's increasing importance, President Barack Obama and Defense Secretary Robert Gates appointed GEN Alexander as the first commander of USCYBERCOM, a newly created military institution charged with defending the nation's security in cyberspace against sophisticated cyber threats to businesses and government operations in an increasingly interconnected world. A leader with vision and a pragmatic approach to tackling the ever-changing cyber threat landscape, GEN Alexander built IronNet to bring this knowledge and experience to the private sector and fill in a critical gap between cyber threats and available security technology. IronNet provides best-in-class cyber defense based on complex behavioral modeling, big-data analytics and advanced computing capability. GEN Alexander holds a B.S. from the U.S. Military Academy, an M.S. in Business Administration from Boston University and M.S. degrees in Systems Technology, Physics and National Security Strategy. Mr. Scott Charney Corporate Vice President, Security Policy, Microsoft Corporation Mr. Scott Charney is Vice President for Security Policy at Microsoft, working with public and private sector organizations to develop and implement strategies to help secure the IT ecosystem. He currently serves as Vice Chair of the National Security Telecommunications Advisory Committee, as a Commissioner on the Global Commission for the Stability of Cyberspace, and as Chair of the Board of the Global Cyber Alliance. Prior to his current position, Mr. Charney led Microsoft's Trustworthy Computing Group where he was responsible for enforcing Microsoft's mandatory security engineering policies and implementing Microsoft's security strategy. Before that, Mr. Charney served as chief of the Computer Crime and Intellectual Property Section (CCIPS) at the U.S. Department of Justice (DOJ) where he was responsible for implementing DOJ's computer crime and intellectual property initiatives. Under his direction, CCIPS investigated and prosecuted national and international hacker cases, economic espionage cases, and violations of the federal criminal copyright and trademark laws. He served three years as chair of the G8 Subgroup on High-Tech Crime, was vice chair of the Organization of Economic Cooperation and Development (OECD) Group of Experts on Security and Privacy, led the U.S. Delegation to the OECD on Cryptography Policy, and was co-chair of the Center for Strategic and International Studies Commission on Cybersecurity for the 44th Presidency. Mr. Charney graduated from the Syracuse University College of Law with honors and received his undergraduate degree from the State University of New York at Binghamton. Mr. Kang Meng-Chow Principal, Security Assurance, Amazon Web Services Meng-Chow has been a practicing information security professional for more than 30 years with field experience spanning from technical to management in the various information security and risk management roles, including the Singapore government, major multi-national financial institutions, and global security and technology providers. Meng-Chow's research and part of his experience in the field have been published in his book, \"Responsive Security – Be ready to be secure\", by CRC Press in Oct 2013. His contributions to the information security industry and community have also been marked by numerous industry awards As leader of the security assurance team in AWS Asia Pacific, Japan, and China region, Meng-Chow and his team work with customers to identify and address related concerns and needs in cloud computing security. Meng-Chow has been active in the information security community, and was a Director of the (ISC)2 Board from Jan 2015 to Dec 2017. He was also recipient of the (ISC)2 James Wade Service Award in 2014. Meng-Chow has also been contributing to both local and international security standardization efforts since 1998, in which he has held several committee and working group chair and editorial positions in the Singapore national standards body, ITU-T SG17, and ISO\/IEC JTC 1 SC 27. Meng-Chow is also co-Chair of the Asia Regional Information Security Exchange (RAISE) Forum, which he co-founded with a group of security experts in 2004. Besides contributing to the industry and community, Meng-Chow continues to conduct research and teach information security as an Associate Professor (Adjunct) with the School of Computer Science & Engineering at Nanyang Technology University, Singapore. Meng-Chow received his MSc degree in Information Security from the Royal Holloway and Bedford New College, University of London, and completed his PhD in Information Security Risk Management at the Southern Cross University, Australia. He has also been a Certified Information Systems Security Professional (CISSP) since 1998 Mr. David Koh Commissioner of Cybersecurity and Chief Executive, Cyber Security Agency of Singapore Mr David Koh is the Commissioner of Cybersecurity and Chief Executive of the Cyber Security Agency (CSA) of Singapore. As a Commissioner, he has the legal authority to investigate cyber threats and incidents to ensure that essential services are not disrupted in the event of a cyber-attack. Concurrently, as Chief Executive of CSA, he leads Singapore's efforts to provide dedicated and centralised oversight of national cyber security functions. These include enforcing the cybersecurity legislation, strategy and policy development, cyber security operations, ecosystem development, public outreach and international engagement. Mr Koh also sits on the Boards of the Government Technology Agency (GovTech), DSO National Laboratories (DSO), the Monetary Authority of Singapore (MAS) Cyber Security Advisory Panel and the Healthcare Cybersecurity Advisory Panel (HCAP). Prior to his current appointments, Mr Koh served in the SAF and held various command and staff appointments in MINDEF and the SAF. He previously held the positions of Deputy Secretary (Special Projects) and Defence Cyber Chief of MINDEF, where he was responsible for leading and coordinating cyber defence policy, capability development, and operations for Singapore's defence cluster. Mr Koh is the recipient of the first Billington CyberSecurity International Leadership Award. He has also been awarded the Public Administration Medal – Gold, the Public Administration Medal – Silver (Military), the Public Administration Medal – Bronze (Military), and the Commendation Medal (Military). Mr Koh has a Master's degree in Public Administration from Harvard University, USA; and a Bachelor's degree in Electrical and Electronics Engineering from King's College, London, UK. He and his wife, Marlene, have three children, Daniel, Rachel and Michael. Ms. Cheri McGuire Chief Technology Officer, SWIFT Ms. McGuire is a technology and cyber security risk and advisory leader with more than 30 years in strategy, policy, and operations, and spanning the financial, technology, consulting and government sectors. She currently serves as the Chief Technology Officer for SWIFT, a global member-owned cooperative providing secure financial messaging services and products that connect more than 11,000 financial organizations in more than 200 countries and territories. As CTO, she oversees all aspects of the SWIFT technology platform, network, cloud capabilities and security, with a focus on resilience, trust and innovation. In addition, she is a non-resident scholar for the Cyber Policy Initiative and member of the FinCyber Advisory Group at the Carnegie Endowment for International Peace, a leading global think tank. She also sits on the Board of Directors for the Cybercrime Support Network, a non-profit partnering with federal, state and local organizations to help individuals and small businesses respond to and recover from the impacts of cybercrime. Prior to her role at SWIFT, she served on the board of directors for Entrust Corporation, and on the advisory boards for Tenable, Garrison, Security Scorecard, and X-Analytics corporations. From 2016 to 2019, she served as managing director and Group Chief Information Security Officer for Standard Chartered PLC in London. She was responsible for the bank's global information and cyber risk management strategy, governance, policy, training\/awareness, third party security risk, control assurance testing, regulatory engagement, and industry partnerships. Prior to Standard Chartered, she served as vice president of global government affairs and cybersecurity policy at Symantec, director for critical infrastructure and cybersecurity in Microsoft's Trustworthy Computing Group, director of the DHS National Cyber Security Division\/US-CERT, program manager at Booz Allen Hamilton, and as a congressional staffer. In addition, she previously served on the World Economic Forum Global Future Council on Cybersecurity, the Europol Advisory Group on Financial Services, the UK Cyber Defence Alliance Board, and the Industry Executive Subcommittee of the President's National Security Telecommunications Advisory Committee. She has testified numerous times as an invited expert before the US Congress. Mr. Udi Mokady Chairman and Chief Executive Officer, CyberArk Udi Mokady is the Chairman and CEO of CyberArk, and a pioneer in establishing the Privileged Account Security software market. Since co-founding the company in 1999, Mokady has entrenched CyberArk as the market leader. During his tenure at CyberArk, Mokady has also served as CyberArk's chief strategist and visionary, overseeing global expansion, management, execution and corporate development. Since assuming the position of CEO in 2005, Mokady's leadership and direction has been instrumental in guiding CyberArk to achieve record growth, while accelerating overall market adoption for privileged access security solutions to protect against an evolving advanced threat landscape. Mokady was elected Chairman of the Board in 2016. Prior to his role as CEO, Mokady served as CyberArk's COO between 1999 and 2005. During this time, Mokady established CyberArk's US headquarters in Newton, Massachusetts and successfully transitioned the company to a market leadership position in Privileged Access Security by helping organizations to recognize the connection between privileged access and advanced internal and external security threats. Mokady also orchestrated the company's market expansion in the US, Europe, and Asia by elevating awareness of privilege-related security and compliance risks while successfully implementing and managing channel development, international sales operations and marketing for CyberArk's award winning information security products. Prior to CyberArk, Mokady specialized in legal management and business development for international high-tech companies. He previously served as the general counsel at Tadiran Spectralink, a highly specialized producer of secure wireless communications systems. Mokady received the 2018 Asper Award for Global Entrepreneurship from Brandeis University and a 2017 SC Media Reboot Award as a cyber security influencer. He was named the 2014 Ernst & Young Entrepreneur of the Year for the Technology Security category in New England. Mokady is a member of the Monetary Authority of Singapore (MAS) Cyber Security Advisory Panel and was a member of the Demisto Board of Directors prior to its acquisition by Palo Alto Networks in March 2019. Mr. Jason Witty Chief Security Office, United Services Automobile Association Jason Witty serves as the Chief Security Officer (CSO) at United Services Automobile Association (USAA), accountable for Information Security, Physical Security, Privacy, Operational Resiliency, Crisis Management, Executive Protection and Corporate Investigations across the firm, which provides insurance, investing and banking solutions to members of the U.S. military, veterans who have honorably served, and their families. Jason is an award-winning CIO\/CISO and a certified Information Systems Security Management Professional (ISSMP) with more than 28 years of experience on information risk management. He is a delivery and execution-oriented leader with a unique blend of executive leadership, management and technical skills, and extensive background in risk management. He is a strong motivator that uses outstanding empathy, communication and negotiation skills to solve business and IT challenges. Prior to his current role, Jason was the Chief Information Officer (CIO) of Cybersecurity & Technology Controls and Global Chief Information Security Officer (CISO) at J.P.Morgan Chase. There, he had responsibility for the firm's cybersecurity, technology controls and technology resiliency programs. He lead a team of approximately 3,300 people operating in 23 countries and nearly 50 cities driving transformative change across the company. Before that, he was the EVP and CISO at U.S. Bancorp, providing singular accountability for all information security controls in the company. He was simultaneously responsible for enterprise-wide customer authentication products as well as internet and DDA channel fraud. Earlier in his career, Jason also served as the Senior Vice President and Cyber Threat Prevention Services Executive at Bank of America, where he was responsible for a team of information security professionals spanning eight countries who provided global information security risk prevention and deterrence services. Throughout his career, Jason has also provided extensive industry leadership. He has led multiple classified and unclassified sector-wide initiatives to upgrade the security posture for U.S. Critical National Infrastructure, including overseeing creation of industry-wide products for destructive malware best practices and utilization of clearances within the financial sector. He currently serves as the Vice-Chair of the National Technology Security Coalition (NTSC) and also served as the Chair of the Financial Services and Information Sharing and Analysis Center (FS-ISAC) from 2014-2019. He previously served as the Sector Chief for Financial Services in FBI Chicago's Infragard program. Jason has a Bachelor's degree in Electrical Engineering Technology from Old Dominion University. Mr. Doron Tamir Chairman and Co-Founder, Cyber Security Group B. General Doron Tamir (Ret.) is a seasoned security and cyber professional with decades of experience in leading technology oriented organizations in the governmental and private sectors. Since 2015, General Tamir is Chairman of Cyber Security Group (CSG), which he co-founded together with M. General Professor Isaac Ben-Israel and others. CSG is a leading provider of Cyber solutions, services, and strategic consulting to governments, banks, industrial and other enterprises around the world. CSG also establishes cyber innovation centers and cyber schools around the world. In 2012, prior to CSG, General Tamir was nominated to be the Senior Director of the Security Sector at the Israeli National Cyber Directorate (INCD) in the Israeli Prime Minister Office, as part of its founding team. General Tamir also served as Director of International Cooperation at the INCD, and laid the foundation for cooperation with the US Department of Homeland Security (DHS), as well as with other nations around the world. In 1992, General Tamir was appointed to be the Chief Intelligence Officer in the Israeli military. As the Commander of the Israeli Intelligence Corps, General Tamir commanded numerous military units in all aspects of intelligence, including signal, visual, cyber and technology. Between 1968 and 1992, Gen. Tamir had a long career in the Israeli Intelligence Corps, where he commanded numerous intelligence units, in combat, research and other leadership positions. After he completed his military service, and prior to the service at the INCD, General Tamir was Vice President of Strategic Accounts at Ness Technologies, Founder and Managing Director at Corner Shot, and Strategic Consultant to the Israeli Aerospace Industries. Ms. Mihoko Matsubara Chief Cybersecurity Strategist, NTT Corporation, Tokyo Mihoko Matsubara is Chief Cybersecurity Strategist, NTT Corporation, Tokyo, being responsible for cybersecurity thought leadership. She previously served at the Japanese Ministry of Defense for nine years before her MA at the Johns Hopkins School of Advanced International Studies on Fulbright in Washington DC. Prior to joining NTT, she worked as VP and Public Sector Chief Security Officer for Asia-Pacific at Palo Alto Networks. She served on Japanese government's cybersecurity R&D policy committee between 2014 and 2018. Mihoko is a prolific writer and has published articles from the Council on Foreign Relations, Lawfare, New America, the RUSI Journal, etc. She published a cybersecurity book from the Shinchosha Publishing Co., Ltd in 2019, which won a JFY 2020 award by the Okawa Foundation for Information and Telecommunications. She has spoken at various engagements internationally such as the NIST Cybersecurity Risk Management Conference 2018 in Baltimore, the RSA Conference 2018 and 2019 in San Francisco, Singapore International Cyber Week 2019, the EU Cyber Forum 2019 in Brussels, and CyCon 2015 and 2019 in Tallinn, Estonia. She is Adjunct Fellow at the Pacific Forum, Honolulu, and Associate Fellow at the Henry Jackson Society, London Mr. Patrick Opet Head of Cybersecurity and Technology Controls and Global Chief Information Security Officer, JPMorgan Chase Patrick Opet works for JPMorgan Chase as Head of Cybersecurity & Technology Controls and the firm's Global Chief Information Security Officer. He is currently responsible for the technology strategy, design, development and delivery of the firm's defensive systems and technology controls and additionally, serves as a mentor in our Diversity, Equity and Inclusion programs. Pat joined JPMorgan Chase from Lockheed Martin in 2014 as an Executive Director and the Global Head of Cybersecurity Programs, leading the development of JPMorgan Chase's cybersecurity technology strategy and the firm's first cross-LOB cybersecurity investment plan. Since joining, Pat was promoted to Managing Director and became a Distinguished Engineer and a member of the Global Technology Architecture Committee. He has an M.S. from the University of Maryland in Computer Systems Management & Information Assurance and a B.S. from George Washington University in Computer Engineering. Mr. Phil Venables Chief Information Security Officer and Vice President, Google Cloud Phil Venables is the Chief Information Security Officer and Vice President of Google Cloud where he leads the risk, security, compliance, and privacy teams. Additionally, he oversees a team of security industry experts and leaders in the Google Cloud Office of the CISO who partner with customers on their secure digital transformations. Prior to joining Google Cloud, Phil was a Partner at Goldman Sachs where he held multiple roles over a long career, initially as their first Chief Information Security Officer, a role he held for 17 years. In subsequent roles he was Chief Risk Officer for the firm's operational risks, an operating partner in their private equity business and a senior advisor to the firm's clients and executive leadership on cybersecurity, technology risk, digital business risk, and operational resilience. In addition to this, Phil was a Board Director of Goldman Sachs Bank (USA). Before Goldman Sachs, Phil held multiple Chief Information Security Officer as well as senior engineering roles across a range of finance, energy and technology companies. Outside of Google, Phil serves on the boards of the NYU Tandon School of Engineering and the NYU Stern Business School Volatility and Risk Institute. He also serves on the Information Security and Privacy Advisory Board of NIST and is a member of the Council on Foreign Relations. Phil earned a BSc (Hons) in Computer Science from the University of York and an MSc in Computation and Cryptography from the Queen's College at Oxford University. He was awarded the designation of Chartered Engineer in 1995 and Chartered Scientist in 2002 and was elected a Fellow of the British Computer Society in 2005. Mr. Chris Krebs Founding Partner of the Krebs Stamos Group Christopher Krebs is Founding Partner of the Krebs Stamos Group and Chair of the Commission on Information Disorder at the Aspen Institute. He previously served as the first director of the Department of Homeland Security's (DHS) Cybersecurity and Infrastructure Security Agency (CISA) where he oversaw the Agency's efforts to manage risk to the nation's businesses and government agencies, bringing together partners to collectively defend against cyber and physical threats. Before serving as CISA Director, Mr. Krebs was appointed in August 2017 as the Assistant Secretary for Infrastructure Protection. Mr. Krebs joined the DHS in March 2017, first serving as Senior Counsellor to the Secretary. Prior to coming to DHS, he led Microsoft's U.S. cybersecurity policy efforts. Mr. Krebs holds a bachelor's degree in environmental sciences from the University of Virginia and a J.D. from the Antonin Scalia Law School at George Mason University. Monetary Authority of Singapore Subscribe to Updates Get notified whenever news and updates are posted on this website. © 2022, Government of Singapore.Last updated on 21 Oct 2021","tfidf_cossim":0.3594798194,"title":"Cyber Security Advisory Panel - Monetary Authority of Singapore","unique_query_fields_count":0.0,"url":"https:\/\/www.mas.gov.sg\/who-we-are\/MAS-Advisory-Panels-and-Committees\/Cyber-Security-Advisory-Panel"}